CREATE database DICTIONARY;
use DICTIONARY;

CREATE TABLE KEYWORD(
Id int not null auto_increment primary key,
stationName varchar(25) not null unique  
);

INSERT INTO KEYWORD values(1, "Авиамоторная"), (2, "Автозаводская"), (3, "Академическая"),
(4, "Александровский сад"), (5, "Алексеевская"), (6, "Алма-атинская"), (7, "Алтуфьево"), (8, "Аннино"),
(9, "Арбатская"), (10, "Аэропорт"), (11, "Бабушкинская"), (12, "Богратионовская"), (13, "Барикадная"), (14, "Бауманская"),
(15, "Беговая"), (16, "Жулебино"), (17, "Измаиловская"), (18, "Калужская"),(19, "Кантемировская"), (20, "Каховская"), (21, "Каширская"),
(22, "Киевская"), (23, "Китай город"), (24, "Кожуховская"), (25, "Коломенская"), (26, "Комсомольская"), (27, "Коньково"), (28, "Красногвардейская"),
(29, "Октябрьская"), (30, "Октябрьское поле"), (31, "Орехово"), (32, "Отрадное"), (33, "Охотный ряд"), (34, "Павелецкая"),
(35, "Парк культуры"), (36, "Парк победы"), (37, "Партизанское"), (38, "Первомаевское"), (39, "Перово"), (40, "Петровское-Разумовское"),
(41, "Печатники"), (42, "Пеонерское"), (43, "Планерная"), (44, "Таганская"), (45, "Тверская"), (46, "Театральная"),
(47, "Текстильщики"), (48, "Тёплый стан"), (49, "Тимирязовская"), (50, "Третьяковская"), (51, "Тульская"), (52, "Тургеневская"),
(53, "Тушинская"), (54, "Улица 1905 года"), (55, "Улица Академика Янгеля"), (56, "Улица Горчакова"), (57, "Улица Скобелевская"), 
(58, "Университет"), (59, "Бирюлово");
INSERT INTO KEYWORD values(59, "Бирюлёво");
SELECT * FROM KEYWORD ORDER BY(stationName);
-- Бирюлёво 
DELETE FROM KEYWORD WHERE stationName LIKE "%Аэропорт%"; 
INSERT INTO KEYWORD (stationName) VALUES ("Бирюлёво");


